#include <iostream>

using namespace std;

// ---------------------------------------------------
// Функція перевіряє чи є рік високосним
//так ми перевіряєм кодні 4 роки і якщо доходим до числа що ділиться на 100 //перевіряєсм щоб він ще ділився на 400

// ---------------------------------------------------
bool isLeap(int year) {

    // Рік високосний якщо:
    // ділиться на 4 і не ділиться на 100
    // або ділиться на 400

    if ((year % 4 == 0 && year % 100 != 0)
        || (year % 400 == 0)) {

        return true;
    }

    return false;
}

int main(void) {

    for (int yr = 1995; yr < 2017; yr++) {

        cout << yr << " -> "
            << isLeap(yr) << endl;
    }

    return 0;
}